<h3> Creating DataFrames</h3>

In [1]:
import pandas as pd

In [39]:
#Creating DataFrame
df=pd.DataFrame({"Name":["Alice","Bob","Charlie","Diana"],"Age":[23,25,22,24],"Gender":["Female","Male","Male","Female"],"Score":[85,78,90,92]})
df

      Name  Age  Gender  Score
0    Alice   23  Female     85
1      Bob   25    Male     78
2  Charlie   22    Male     90
3    Diana   24  Female     92

In [3]:
#Display the first 3 rows of the DataFrame.
df.head(3)

      Name  Age  Gender  Score
0    Alice   23  Female     85
1      Bob   25    Male     78
2  Charlie   22    Male     90

In [4]:
#Get the column names.
df.columns

Index(['Name', 'Age', 'Gender', 'Score'], dtype='object')

In [5]:
#Get the column data types.
df.dtypes

Name      object
Age        int64
Gender    object
Score      int64
dtype: object

In [6]:
#Adding the Passed column
df["Passed"]=df.Score>80
df

      Name  Age  Gender  Score  Passed
0    Alice   23  Female     85    True
1      Bob   25    Male     78   False
2  Charlie   22    Male     90    True
3    Diana   24  Female     92    True

In [7]:
#Deleting the gender column
del df["Gender"]
df

      Name  Age  Score  Passed
0    Alice   23     85    True
1      Bob   25     78   False
2  Charlie   22     90    True
3    Diana   24     92    True

<h3> Indexing and Slicing</h3>

In [8]:
#displaying only Name and Score column
df.loc[:,["Name","Score"]]

      Name  Score
0    Alice     85
1      Bob     78
2  Charlie     90
3    Diana     92

In [9]:
#Filter and display rows where Score is greater than 85
df.loc[df.Score>85]

      Name  Age  Score  Passed
2  Charlie   22     90    True
3    Diana   24     92    True

In [10]:
#Display the row for the student named "Bob" using loc
df.loc[df.Name=="Bob"]

  Name  Age  Score  Passed
1  Bob   25     78   False

In [11]:
#Last 2 rows
df.tail(2)

      Name  Age  Score  Passed
2  Charlie   22     90    True
3    Diana   24     92    True

<h3>Data Analysis</h3>

In [13]:
#average age
df.Age.mean()

np.float64(23.5)

In [27]:
#minimum and maximum score
df.Score.agg(["min","max"])

min    78
max    92
Name: Score, dtype: int64

In [28]:
#Count the number of students who passed
df.Passed.loc[df.Passed].sum()

np.int64(3)

In [30]:
#Group the data by the Passed column and calculate the average score for each group
df.groupby("Passed").Score.mean()

Passed
False    78.0
True     89.0
Name: Score, dtype: float64

In [32]:
#Sort the DataFrame by Score in descending order
df.sort_values(by="Score",ascending=False)

      Name  Age  Score  Passed
3    Diana   24     92    True
2  Charlie   22     90    True
0    Alice   23     85    True
1      Bob   25     78   False

<h3> Importing and Exporting Data</h3>

In [36]:
#Save the DataFrame from Task 1 as a CSV file named students.csv
df.to_csv("students.csv",index=False)

In [38]:
#reading csv
pd.read_csv("students.csv")

      Name  Age  Score  Passed
0    Alice   23     85    True
1      Bob   25     78   False
2  Charlie   22     90    True
3    Diana   24     92    True

<h3>Real-World Problem</h3>

In [40]:
#Creating the dataframe
df2=pd.DataFrame({
    "Product": ["Laptop", "Smartphone", "Desk", "Chair"],
    "Category": ["Electronics", "Electronics", "Furniture", "Furniture"],
    "Sales": [500, 300, 200, 150],
    "Discount": [50, 30, 20, 15]
})
df2

      Product     Category  Sales  Discount
0      Laptop  Electronics    500        50
1  Smartphone  Electronics    300        30
2        Desk    Furniture    200        20
3       Chair    Furniture    150        15

In [41]:
#Creating Net Sales column
df2["Net Sales"]=df2.Sales-df2.Discount
df2

      Product     Category  Sales  Discount  Net Sales
0      Laptop  Electronics    500        50        450
1  Smartphone  Electronics    300        30        270
2        Desk    Furniture    200        20        180
3       Chair    Furniture    150        15        135

In [46]:
#Total sales for each category
df2.groupby("Category").Sales.sum()

Category
Electronics    800
Furniture      350
Name: Sales, dtype: int64

In [50]:
#Product with highest net sales
df2.Product.loc[df2["Net Sales"].idxmax()]

'Laptop'